app/controllers/tweets_controller.rb

SELECT `tweets`.* FROM `tweets`
---
    def index
      @tweets = Tweet.all

INSERT INTO `tweets` (`created_at`, `updated_at`, `body`) VALUES ('2020-05-29 14:45:38.452480', '2020-05-29 14:45:38.452480', 'こんばんは')
---
    def create
      @tweet = Tweet.new(tweet_params)
      if @tweet.save

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = 'おやすみ', `tweets`.`updated_at` = '2020-06-01 02:42:52.022838' WHERE `tweets`.`id` = 1
---
    def update
      @tweet = Tweet.find(params[:id])
      if @tweet.update(tweet_params)

DELETE FROM `tweets` WHERE `tweets`.`id` = 3
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 3 LIMIT 1
---
    def destroy
      Tweet.find(params[:id]).destroy